package com.abc.qwert.thescience;

class PhysValues {


    int getLength(){
        return formulaNames.length;

    }

    String getName(int n){
        return formulaNames[n];

    }

    String getGroup(int n){
        return formulaGroups[n];

    }

    int getImage(int n){
        return formulaImages[n];

    }

    String getAnswerMeasure(int n){
        return answerMeasure[n];
    }

    String[] getHintImage(int n){
        return imageHints[n];
    }

    String[] getMeasure(int n){
        return measure[n];
    }

    String[] getHints(int n){
        return formulaHintsFields[n];
    }

    int getFieldsLength(int n){
        return getHints(n).length;
    }

    String getMethodName(int n){
        return methods[n];
    }

    String getCalcDescription(int valuePosition, int numberPosition){
        return calcDescription[valuePosition][numberPosition];
    }


    String[] formulaNames;

    String[] formulaGroups;

    String[][] formulaHintsFields;

    String[][] measure;

    String[] answerMeasure;

    String[][] calcDescription;


    private static int[] formulaImages = {
            R.drawable.aa,//1
            R.drawable.a,//2
            R.drawable.bb,
            R.drawable.c,//3
            R.drawable.cc,//4
            R.drawable.cc,
            R.drawable.dd,//5
            R.drawable.d,//6
            R.drawable.ee,//7
            R.drawable.ff,//8
            R.drawable.ff,//9
            R.drawable.h,//10
            R.drawable.ii,//11
            R.drawable.j,//12
            R.drawable.l,//13
            R.drawable.m,//14
            R.drawable.mm,//15
            R.drawable.nu,//16
            R.drawable.nu,
            R.drawable.nn,//17
            R.drawable.nn,
            R.drawable.p,//18
            R.drawable.p,
            R.drawable.pp,
            R.drawable.pp,//19
            R.drawable.q,//20
            R.drawable.qq,//21
            R.drawable.r,//22
            R.drawable.rr,//23
            R.drawable.ss,//24
            R.drawable.s,//25
            R.drawable.tt,//26
            R.drawable.t,//27
            R.drawable.tt,
            R.drawable.t,//28
            R.drawable.uu,//29
            R.drawable.uu,//30
            R.drawable.vv,//31
            R.drawable.v,//32
            R.drawable.x,//33
            R.drawable.mu,//34
            R.drawable.rho,
            R.drawable.omega,//35
            R.drawable.eta,
            R.drawable.phi};//36

    private static String[][] imageHints = {
            {"F","s","α","F","m","h","h","k","x","x","N","t","υ","υ","A","A","η","p","V","V","Q","U", "U", "I", "U", "R", "P"},
            {"υ","υ","t","S","x","x","υ","r","ω","F","m"},
            {"F", "I", "l", "Ф", "S", "α"},
            {"Q","m","t","t","C"},
            {"c","m"},
            {"q", "U", "ε", "S", "d", "ϕ", "r"},
            {"F"},
            {"M","F"},
            {"m","υ","h","k","x","E","E","E","ν"},
            {"D"},
            {"a","m","μ","N","k","x","m","m","r","υ","υ","M","d","p","S","ρ","H","S","S","V","A","s", "α", "N", "t"},
            {"A","ρ","F","S","F","S","E", "m", "h", "h"},
            {"t","S","n","q","υ","j","U","R","A","P","Q","I","I"},
            {"I","S"},
            {"T","R","S","ρ"},
            {"a","F","F","P","m","F","r","t","υ","υ","ρ","V","A","h","h","E","υ","E","h","T","k","n", "M","p","V","T","U","Q","c","t","t","C","m","E"},
            {"F","d"},
            {"m","M"},
            {"N", "t", "T", "υ", "r", "ω"},
            {"F","μ"},
            {"F", "υ", "A", "t"},
            {"m","υ"},
            {"V", "m", "M", "T", "n", "ρ", "h", "F", "S", "A", "V", "V"},
            {"m", "a"},
            {"A","t","I","U","R"},
            {"W","q","r","I","t"},
            {"c","m","t","t","A","U","U","Q","Q","η","I","R","t","q"},
            {"υ","T","ν","ω","a"},
            {"I","U","ρ","l","S","A","t","P","Q"},
            {"F","H","ρ","F","j","I","R","l"},
            {"υ","t","υ","a","A","F","α","F"},
            {"t","N","ν","υ","r","ω","m","k","l"},
            {"p","V","m","M","U","Q","c","t","t","T","T","η"},
            {"t", "T"},
            {"υ","s","x","x","a","υ","ν","N","T","m","ω","ϕ","F","I","q","A","U","R","P","Q", "N", "N", "T"},
            {"I","R","A","t","P","U"},
            {"m","M","T"},
            {"ρ","m","F","p","M","T","A","V","V"},
            {"s","t","x","x","a","υ","υ","r","T","ν","ω","F","m","N","E","A"},
            {"υ","t","υ","a","F","k","A","x","x","E"},
            {"F","N"},
            {"m", "V", "p", "h", "S", "F", "R", "l"},
            {"ϕ","t","T","ν","υ","r","a"},
            {"A","Q","Q","Q","T","T"},
            {"B", "S", "α"}};


    private static String[] methods = {
            "calcA",
            "calca",
            "calcB",
            "calcc",
            "calcC",
            "calcCC",
            "calcD",
            "calcd",
            "calcE",
            "calcF",
            "calcFF",
            "calch",
            "calcI",
            "calcj",
            "calcl",
            "calcm",
            "calcM",
            "calcnu",
            "calcnunu",
            "calcN",
            "calcNN",
            "calcp",
            "calcpp",
            "calcP",
            "calcPP",
            "calcq",
            "calcQ",
            "calcr",
            "calcR",
            "calcS",
            "calcs",
            "calcT",
            "calct",
            "calcTT",
            "calctt",
            "calcU",
            "calcUU",
            "calcV",
            "calcv",
            "calcx",
            "calcmu",
            "calcrho",
            "calcomega",
            "calceta",
            "calcPhi"
    };


}








class PhysValuesRU extends PhysValues{

    PhysValuesRU(){
        formulaNames = new String[]{
                "Работа",//1
                "Ускорение",//2
                "Индукция магнитного поля",
                "Удельная теплоёмкость",//3
                "Теплоёмкость",//4
                "Электроемкость конденсатора",
                "Оптическая сила",//5
                "Диаметр",//6
                "Энергия",//7
                "Фокусное расстояние",//8
                "Сила",//9
                "Высота",//10
                "Сила тока",//11
                "Плотность тока",//12
                "Длина",//13
                "Масса",//14
                "Момент силы относительно оси вращения",//15
                "Количество вещества",//16
                "Частота обращения",
                "Сила реакции опоры",//17
                "Механическая мощность",
                "Импульс",//18
                "Давление",
                "Вес тела",
                "Мощность тока",//19
                "Заряд",//20
                "Количество теплоты",//21
                "Радиус",//22
                "Сопротивление",//23
                "Площадь",//24
                "Перемещение",//25
                "Период обращения",//26
                "Температура (°C)",//27
                "Конвертер температур",
                "Время",//28
                "Напряжение",//29
                "Внутренняя энергия",//30
                "Объём",//31
                "Скорость",//32
                "Перемещение",//33
                "Коэффициент трения",//34
                "Плотность",
                "Угловая скорость",//35
                "КПД",//36
                "Магнитный поток"
        };

        formulaGroups = new String[]{
                "Механика",//1
                "Механика",//2
                "Электрические явления",
                "Тепловые явления",//3
                "Тепловые явления",//4
                "Электродинамика",
                "Световые явления",//5
                "Механика",//6
                "Механика",//7
                "Световые явления",//8
                "Механика",//9
                "Механика",//10
                "Электродинамика",//11
                "Электродинамика",//12
                "Механика",//13
                "Механика",//14
                "Статика",//15
                "Молекулярная физика",//16
                "Механика",
                "Механика",//17
                "Механика",
                "Механика",//18
                "Механика",
                "Механика",
                "Электродинамика",//19
                "Электродинамика",//20
                "Тепловые явления",//21
                "Механика",//22
                "Электродинамика",//23
                "Пространство",//24
                "Механика",//25
                "Механика",//26
                "Тепловые явления",//27
                "Тепловые явления",
                "Механика",//28
                "Электродинамика",//29
                "Термодинамика",//30
                "Пространство",//31
                "Механика",//32
                "Механика",//33
                "Механика",//34
                "Механика",
                "Механика",//35
                "Механика",//36
                "Электрические явления"
        };

        formulaHintsFields = new String[][]{
                {"Приложенная сила", "Путь", "Угол приложенной силы", "Сила трения", "Масса тела", "Начальная высота", "Конечная высота", "Коэффициент жесткости пружины", "Начальная координата", "Конечная координата", "Механическая мощность", "Время", "Начальная скорость", "Конечная скорость", "Полезная работа", "Полная работа", "КПД", "Давление на газ", "Начальный объем", "Конечный объем", "Энергия сообщенная системе", "Начальная врутренняя энергия", "Конечная внутренняя энергия", "Сила тока", "Напряжение тока", "Сопротивление тока", "Мощность"},
                {"Конечная скорость", "Начальная скорость", "Время", "Путь", "Конечная координата", "Начальная координата", "Линейная скорость", "Радиус кривизны", "Угловая скорость", "Сила приложенная к телу", "Масса тела"},
                {"Сила со стороны эл. поля на проводник", "Сила тока", "Длина проводника", "Магнитный поток", "Площадь замкнутого контура", "Угол потока к плоскости контура"},
                {"Количество теплоты", "Масса тела", "Начальная температура", "Конечная температура", "Теплоемкость"},
                {"Удельная теплоемкость", "Масса тела"},
                {"Электрический заряд", "Напряжение между обкладками", "Относительная диэлектрическая проницаемость среды", "Площадь обкладки конденсатора", "Расстояние между обкладками", "Электрический потенциал", "Радиус шара"},
                {"Фокусное расстояние"},
                {"Момент силы", "Приложенная сила"},
                {"Масса", "Скорость", "Высота поднятия", "Коэффициент упругости пружины", "Деформация пружины", "Полная энергия", "Кинетическая энергия", "Потенциальная энергия", "Частота фотонов"},
                {"Оптическая сила линзы"},
                {"Ускорение", "Масса тела", "Коэффициент трения скольжения", "Сила нормальной реакции опоры", "Жесткость тела", "Перемещение", "Масса первого тела", "Масса второго тела", "Расстояние между телами", "Конечная скорость", "Начальная скорость", "Момент силы относительно оси вращения", "Диаметр", "Давление жидкости", "Площадь поверхности", "Плотность жидкости", "Высота сосуда", "Площадь поверхности дна", "Площадь боковой поверхности сосуда", "Объем жидкости", "Работа", "Путь", "Угол приложенной силы", "Мощность", "Время"},
                {"Работа силы тяжести", "Плотность жидкости", "Сила давления на дно сосуда", "Площадь поверхности дна", "Сила давления на бока сосуда", "Площадь боковой порхности", "Потенциальная энергия", "Масса тела", "Начальная высота", "Конечная высота"},
                {"Время", "Площадь поперечного сечения проводника", "Количество заряженных частиц", "Заряд", "Скорость движения частиц", "Плотность тока", "Напряжение тока", "Сопротивление тока", "Работа тока", "Мощность тока", "Выделенное количество теплоты", "Амплитудная сила тока", "Действующая сила переменного тока"},
                {"Сила тока", "Площадь сечения проводника"},
                {"Период колебаний математического маятника", "Сопротивление тока", "Площадь поперечного сечения проводника", "Плотность вещества"},
                {"Ускорение", "Сила приложенная к телу", "Сила тяжести", "Вес тела", "Масса одного из двух тел", "Сила притяжения двух тел", "Расстояние между двумя телами", "Время", "Конечная скорость", "Начальная скорость", "Плотность вещества", "Объем вещества", "Работа", "Начальная высота", "Конечная высота", "Кинетическая энергия", "Скорость тела", "Потенциальная энергия", "Высота поднятия тела", "Период колебаний пружинного маятника", "Жесткость пружины", "Количество вещества", "Молярная масса", "Давление идеального  газа", "Объем идеального газа", "Температура идеального газа", "Внутренняя энергия идеального газа", "Количество теплоты", "Удельная теплоемкость", "Начальная температура", "Конечная температура", "Теплоемкость", "Масса тела в покое", "Энергия"},
                {"Сила", "Диаметр"},
                {"Масса вещества", "Молярная масса вещества"},
                {"Количество оборотов", "Время", "Период обращения", "Линейная скорость", "Радиус", "Угловая скорость"},
                {"Сила трения", "Коэффициент трения"},
                {"Сила", "Скорость", "Работа", "Время"},
                {"Масса тела", "Скорость тела"},
                {"Объем газа", "Масса идеального газа", "Молярная масса идеального газа", "Температура газа", "Концентрация молекул газа", "Плотность жидкости", "Высота столба жидкости", "Сила", "Площадь", "Работа, совершенная газом", "Начальный объем", "Конечный объем"},
                {"Масса тела", "Ускорение свободного падения"},
                {"Работа тока", "Время", "Сила тока", "Электрическое напряжение", "Сопротивление тока"},
                {"Потенциальная энергия взаимодействия двух зарядов", "Один из двух зарядов", "Расстояние между зарядами", "Сила электрического тока", "Время"},
                {"Удельная теплоемкость", "Масса", "Начальная температура", "Конечная температура", "Работа над телами", "Начальная внутренняя энергия", "Конечная внутренняя энергия", "Количество теплоты нагревателя", "Количество теплоты холодильнику", "КПД", "Сила тока", "Сопротивление тока", "Температура", "Удельная теплота сгорания"},
                {"Линейная скорость", "Период обращения", "Частота обращения", "Угловая скорость", "Центростремительное ускорение"},
                {"Сила тока", "Напряжение тока", "Плотность вещества", "Длина проводника", "Площадь поперечного сечения проводника", "Работа электрического тока", "Время", "Мощность электрического тока", "Количество теплоты"},
                {"Сила давления на дно сосуда", "Высота сосуда", "Плотность", "Сила давления на бока сосуда", "Плотность тока", "Сила тока", "Сопротивление тока", "Длина проводника"},
                {"Скорость", "Время", "Начальная скорость", "Ускорение", "Работа", "Сила", "Угол приложенной силы", "Сила трения"},
                {"Время", "Число обращений", "Частота обращений", "Скорость", "Радиус", "Угловая скорость", "Масса", "Коэффициент упругости", "Длина маятника"},
                {"Давление", "Объем вещества", "Масса", "Молярная масса вещества", "Внутренняя энергия идеального газа", "Количество теплоты", "Удельная теплоемкость", "Начальная температура", "Конечная температура", "Температура нагревателя", "Температура холодильника", "КПД"},
                {"Температура в °C", "Температура в Кельвинах"},
                {"Скорость", "Путь", "Конечная координата", "Начальная координата", "Ускорение", "Начальная скорость", "Частота обращений", "Количество обращений", "Период обращения", "Масса тела", "Угловая скорость", "Угол поворота точки", "Сила приложенная к телу", "Сила тока", "Заряд", "Работа тока", "Напряжение тока", "Сопротивление тока", "Мощность тока", "Количество теплоты", "Количество ядер в искомый момент времени", "Количество ядер в начальный момент времени", "Период полураспада"},
                {"Сила тока", "Сопротивление тока", "Работа электрического тока", "Время", "Мощность электрического тока", "Амплитудное значение переменного напряжения"},
                {"Масса идеального газа", "Молярная масса идеального газа", "Температура идеального газа"},
                {"Плотность вещества", "Масса вещества", "Сила Архимеда", "Давление", "Молярная масса вещества", "Температура", "Работа газа", "Начальный объем газа", "Конечный объем газа"},
                {"Путь", "Время", "Конечная координата", "Начальная координата", "Ускорение", "Конечная скорость", "Начальная скорость", "Радиус", "Период обращения", "Частота обращения", "Угловая скорость", "Сила приложенная к телу", "Масса тела", "Мощность при движении", "Кинетическая энергия", "Работа тела"},
                {"Линейная скорость", "Время", "Начальная скорость", "Ускорение", "Проекция силы упругости", "Жесткость тела", "Работа силы упругости", "Начальная координата", "Конечная координата", "Потенциальная энергия"},
                {"Сила трения", "Сила нормальной реакции опоры"},
                {"Масса вещества", "Объем вещества", "Давление жидкости", "Высота", "Площадь", "Сила", "Электрическое сопротивление", "Длина проводника"},
                {"Угол поворота точки вокруг центра", "Время", "Период обращения", "Частота обращения", "Линейная скорость", "Радиус окружности", "Центростремительное ускорение"},
                {"Полезная работа", "Затраченная энергия", "Теплота от нагревателя", "Теплота холодильнику", "Температура нагревателя", "Температура холодильника"},
                {"Магнитная индукция", "Площадь контура", "Угол между нормалью и плоскостью магнитной индукции"}
        };



        measure = new String[][]{
                {"Н", "м", "°", "Н", "кг", "м", "м", "Н/м", "-", "-", "Вт", "с", "м/с", "м/с", "Дж", "Дж", "%", "Па", "м³", "м³", "Дж", "Дж", "Дж", "А", "В", "Ом", "Вт"},
                {"м/с", "м/с", "с", "м", "-", "-", "м/с", "м", "рад/с", "Н", "кг"},
                {"Н", "А", "м", "Вб", "м²", "°"},
                {"Дж", "кг", "с", "с", "Дж/К"},
                {"Дж/кг·К", "кг"},
                {"Кл", "В", "-", "м²", "м", "В", "м"},
                {"м"},
                {"Н·м", "Н"},
                {"кг", "м/с", "м", "Н/м", "-", "Дж", "Дж", "Дж", "Гц"},
                {"дптр"},
                {"м/с²", "кг", "-", "Н", "Н/м", "-", "кг", "кг", "м", "м/с", "м/с", "Н·м", "м", "Па", "м²", "кг/м³", "м", "м²", "м²", "м³", "Дж", "м", "°", "Вт", "с"},
                {"Дж", "кг/м³", "Н", "м²", "Н", "м²", "Дж", "кг", "м", "м"},
                {"с", "м²", "-", "Кл", "м/с", "А/м²", "В", "Ом", "Дж", "Вт", "Дж", "А", "А"},
                {"А", "м²"},
                {"Гц", "Ом", "м²", "кг/м³"},
                {"м/с²", "Н", "Н", "Н", "кг", "Н", "м", "с", "м/с", "м/с", "кг/м³", "м³", "Дж", "м", "м", "Дж", "м/с", "Дж", "м", "Гц", "Н/м", "моль", "кг/моль", "Па", "л", "К", "Дж", "Дж", "Дж/кг·К", "°C", "°C", "Дж/К", "кг", "Дж"},
                {"Н", "м"},
                {"кг", "кг/моль"},
                {"-", "с", "Гц", "м/с", "м", "рад/с"},
                {"Н", "-"},
                {"Н", "м/с²", "Дж", "с"},
                {"кг", "м/с"},
                {"л", "кг", "г/моль", "К", "-", "кг/м³", "м", "Н", "м²", "Дж", "м³", "м³"},
                {"кг", "м/с²"},
                {"Дж", "с", "А", "В", "Ом"},
                {"Н", "Кл", "м", "Н", "с"},
                {"Дж/кг·К", "кг", "°C", "°C", "Дж", "Дж", "Дж", "Дж", "Дж", "%", "А", "Ом", "°C", "Дж/кг"},
                {"м/с", "Гц", "Гц", "рад/с", "м/с²"},
                {"А", "В", "кг/м³", "м", "м²", "Дж", "с", "Вт", "Дж"},
                {"Н", "м", "кг/м³", "Н", "А/м²", "А", "Ом", "м"},
                {"м/с", "с", "м/с", "м/с²", "Дж", "Н", "°", "Н"},
                {"с", "-", "Гц", "м/с", "м", "рад/с", "кг", "кг/с²", "м"},
                {"Па", "л", "кг", "кг/моль", "Дж", "Дж", "Дж/кг·К", "°C", "°C", "°C", "°C", "%"},
                {"°C", "К"},
                {"м/с", "м", "-", "-", "м/с²", "м/с", "Гц", "-", "Гц", "кг", "рад/с", "°", "Н", "А", "Кл", "Дж", "В", "Ом", "Вт", "Дж", "-", "-", "с"},
                {"А", "Ом", "Дж", "с", "Вт", "В"},
                {"кг", "кг/моль", "К"},
                {"кг/м³", "кг", "Н", "Па", "кг/моль", "К", "Дж", "м³", "м³"},
                {"м", "с", "-", "-", "м/с²", "м/с", "м/с", "м", "Гц", "Гц", "рад/с", "Н", "кг", "Вт", "Дж", "Дж"},
                {"м/с", "с", "м/с", "м/с²", "Н", "Н/м", "Дж", "-", "-", "Дж"},
                {"Н", "Н"},
                {"кг", "м³", "Па", "м", "м²", "Н", "Ом", "м"},
                {"°", "с", "Гц", "Гц", "м/с", "м", "м/с²"},
                {"Дж", "Дж", "Дж", "Дж", "°C", "°C"},
                {"Тл", "м²", "°"}
        };

        answerMeasure = new String[]{
                "Дж",
                "м/с²",
                "Тл",
                "Дж/(кг*К)",
                "Дж/К",
                "Ф",
                "дптр",
                "м",
                "Дж",
                "м",
                "Н",
                "м",
                "А",
                "А/м²",
                "м",
                "кг",
                "Н*м",
                "моль",
                "Гц",
                "Н",
                "Вт",
                "кг*м/с",
                "Па",
                "Н",
                "Вт",
                "Кл",
                "Дж",
                "м",
                "Ом",
                "м²",
                "м",
                "Гц",
                "°C",
                "-",
                "с",
                "В",
                "Дж",
                "м",
                "м/с",
                "м³",
                "-",
                "кг/м³",
                "рад/с",
                "%",
                "Вб"
        };

        calcDescription = new String[][]{
                {"Мощность электрического тока", "Работа электрического тока(без силы тока)", "Работа электрического тока(без напряжения)", "Работа электрического тока(без сопротивления)", "КПД теплового двигателя", "Уравнение первого начала термодинамики", "Работа, совершенная газом", "Теорема о кинетической энергии тела", "Работа силы упругости", "Работа силы тяжести", "Работа силы трения", "Работа постоянной силы с приложенным углом", "Работа постоянной силы"},
                {"Ускорение по второму закону Ньютона", "Центростремительное ускорение через угловую скорость", "Центростремительное ускорение через линейную скорость", "Уравнение равноускоренного движения", "Проекция перемещения при равноускоренном движении без времени", "Зависимость перемещения при равноускоренном движении от времени", "Ускорение при равноускоренном движении"},
                {"Теплоемкость тела", "Количество теплоты при изменении температуры тела"},
                {"Теплоемкость тела"},
                {"Электроемкость шара", "Электроемкость конденсатора через потенциал", "Электроемкость плоского конденсатора", "Электроемкость конденсатора через напряжение"},
                {"Оптическая сила линзы"},
                {"Момент силы относительно оси вращения"},
                {"Энергия фотона", "Связь между массой и энергией", "Полная механическая энергия замкнутой системы тел", "Потенциальная энергия через полную", "Кинетическая энергия через полную", "Потенциальная энергия упруго деформированного тела", "Потенциальная энергия тела", "Кинетическая энергия тела"},
                {"Оптическая сила линзы"},
                {"Работа силы трения", "Работа постоянной силы", "Сила Архимеда", "Сила давления жидкости на боковую поверхность сосуда", "Сила давления жидкости на боковую поверхность сосуда", "Момент силы относительно оси вращения", "Второй закон Ньютона в импульсной форме", "Сила всемирного тяготения", "Сила тяжести", "Проекция силы упругости", "Модуль силы трения", "Сила по второму закону Ньютона"},
                {"Потенциальная энергия тела", "Работа силы тяжести", "Работа силы тяжести", "Сила давления жидкости на боковую поверхность сосуда", "Сила давления жидкости на дно сосуда"},
                {"Действующая сила переменного тока", "Амплитудная сила переменного тока", "Зависимость силы тока от заряда, концентрации, скорости и площади попречного сечения проводника", "Закон Джоуля-Ленца", "Мощность электрического тока", "Мощность электрического тока", "Работа электрического тока", "Работа электрического тока", "Закон ома для участка цепи", "Модуль плотности электрического тока", "Сила электрического тока"},
                {"Модуль плотности электрического тока"},
                {"Электрическое сопротивление", "Период колебаний математического маятника"},
                {"Связь между массой и энергией", "Зависимость массы тела от его скорости", "Теплоемкость тела", "Количество теплоты при изменении температуры тела", "Внутренняя энергия идеального газа", "Уравнение Менделеева-Клапейрона", "Количество вещества", "Период колебаний пружинного маятника", "Теорема о кинетической энергии тела", "Потенциальная энергия тела", "Кинетическая энергия тела", "Работа силы тяжести", "Плотность вещества", "Второй закон Ньютона в импульсной форме", "Закон всемирного тяготения", "Сила тяжести", "Второй закон Ньютона"},
                {"Момент силы относительно оси вращения"},
                {"Количество вещества"},
                {"Угловая скорость, выраженная через частоту обращения", "Линейная скорость, выраженная через частоту обращения", "Связь между периодом и частотой обращения", "Частота обращения"},
                {"Модуль силы трения"},
                {"Мощность при равномерном прямолинейном движении", "Мощность при совершенной работе за единицу времени"},
                {"Импульс тела"},
                {"Уравнение Менделеева-Клапейрона", "Зависимость давления газа от концентрации его молекул и температуры", "Зависимость давления жидкости от высоты ее столба", "Давление", "Работа, совершенная газом"},
                {"Вес тела в неподвижном состоянии", "Вес подброшенного вверх тела", "Вес падающего вниз тела"},
                {"Мощность тока без силы тока", "Мощность тока без напряжения", "Мощность тока без сопротивления", "Мощность тока через его работу"},
                {"Сила электрического тока", "Потенциальная энергия взаимодействия двух электрических зарядов"},
                {"Закон Джоуля-Ленца", "КПД теплового двигателя через работу", "Количество теплоты нагревателя", "Количество теплоты холодильнику", "Уравнение первого начала термодинамики", "Количество теплоты тела при изменении его температуры", "Количество теплоты при сгорании топлива"},
                {"Центростремительное ускорение через угловую скорость", "Центростремительное ускорение через линейную скорость", "Связь между линейной и угловой скоростью", "Линейная скорость через частоту обращения", "Линейная скорость через период обращения"},
                {"Закон Джоуля-Ленца", "Мощность тока без напряжения", "Мощность без силы тока", "Работа тока без напряжения", "Работа без силы тока", "Зависимость сопротивления от рода вещества, длины и поперечного сечения проводника", "Закон Ома для участка цепи"},
                {"Зависимость сопротивления от рода вещества, длины и поперечного сечения проводника", "Модуль плотности электрического тока", "Сила давления жидкости на боковую поверхность сосуда", "Сила давления жидкости на дно сосуда"},
                {"Работа силы трения", "Работа постоянной силы", "Проекция перемещения при равноускоренном движении без времени", "Зависимость перемещения при равноускоренном движении от времени", "Перемещение при равноускоренном движении", "Перемещение при равномерном прямолинейном движении"},
                {"Период колебаний математического маятника", "Период колебаний пружинного маятника", "Угловая скорость, выраженная через период обращения", "Линейная скорость, выраженная через период обращения", "Связь между периодом и частотой обращения", "Период обращения"},
                {"КПД идеальной тепловой машины(Температура нагревателя)", "КПД идеальной тепловой машины(Температура холодильника)", "Количество теплоты, при изменении температуры тела", "Количество теплоты, при изменении температуры тела", "Внутренняя энергия идеального газа", "Уравнение Менделеева-Клапейрона"},
                {"Перевод температуры из °C в Кельвины", "Перевод температуры из Кельвинов в °C"},
                {"Закон радиактивного распада", "Закон Джоуля-Ленца", "Мощность электрического тока", "Работа электрического тока без сопротивления", "Работа электрического тока без напряжения", "Работа электрического тока без силы тока", "Сила электрического тока", "Второй закон Ньютона в импульсной форме", "Угловая скорость", "Период обращения", "Уравнение равноускоренного движения", "Зависимость перемещения при равноускоренном движении от времени", "Перемещение при равноускоренном движении", "Скорость при равноускоренном движении", "Уравнение равномерного прямолинейного движения"},
                {"Действующее значение переменного напряжения", "Мощность электрического тока без сопротивления", "Мощность электрического тока без силы тока", "Работа электрического тока без сопротивления", "Работа электрического тока без силы тока", "Закон Ома для участка цепи"},
                {"Внутренняя энергия идеального газа"},
                {"Работа, совершенная газом", "Работа, совершенная газом", "Уравнение Менделеева-Клапейрона", "Закон Архимеда", "Плотность вещества"},
                {"Теорема о кинетической энергии тела (конечная скорость)", "Теорема о кинетической энергии тела (начальная скорость)", "Кинетическая энергия тела", "Второй закон Ньютона в импульсной форме (конечная скорость)", "Второй закон Ньютона в импульсной форме (начальная скорость)", "Центростремительное ускорение, выраженное через линейную скорость", "Формула связи между линейной и угловой скоростью", "Линейная скорость, выраженная через частоту обращения", "Линейная скорость, выраженная через период обращения", "Уравнение равноускоренного движения", "Проекция перемещения при равноускоренном движении без времени (конечная скорость)", "Проекция перемещения при равноускоренном движении без времени (начальная скорость)", "Зависимость перемещения при равноускоренном движении от времени", "Перемещение при равноускоренном движении (конечная скорость)", "Перемещение при равноускоренном движении (начальная скорость)", "Скорость при равноускоренном движении (конечная скорость)", "Скорость при равноускоренном движении (начальная скорость)", "Уравнение равномерного прямолинейного движения", "Скорость равномерного прямолинейного движения"},
                {"Потенциальная энергия упруго деформированного тела", "Работа силы упругости (начальная длина пружины)", "Работа силы упругости (конечная длина пружины)", "Проекция силы упругости", "Уравнение равноускоренного движения (конечная координата)", "Уравнение равноускоренного движения (начальная координата)", "Уравнение равномерного прямолинейного движения (конечная координата)", "Уравнение равномерного прямолинейного движения (начальная координата)"},
                {"Модуль силы трения"},
                {"Зависимость сопростивления от рода вещества, длины и сечения проводника", "Закон Архимеда", "Сила давление жидкости на поверхность сосуда", "Зависимость давления жидкости от высоты ее столба", "Плотность вещества"},
                {"Центростремительное ускорение, выраженное через угловую скорость", "Формула связи между линейной и угловой скоростью", "Угловая скорость, выраженная через частоту обращения", "Угловая скорость, выраженная через период обращения", "Угловая скорость"},
                {"КПД идеальной тепловой машины", "КПД теплового двигателя", "КПД работы теплового двигателя"},
                {"Индукция магнитного поля", "Магнитный поток"},
                {"Магнитный поток"}

        };

    }

}





class PhysValuesEN extends PhysValues{

    PhysValuesEN(){
        formulaNames = new String[]{
                "Work", // 1
                "Acceleration", // 2
                "Magnetic induction",
                "Specific heat", // 3
                "Heat capacity", // 4
                "Electro-capacity",
                "Optical power", // 5
                "Diameter", // 6
                "Energy", // 7
                "Focal length", // 8
                "Force", // 9
                "Height", // 10
                "Amperage", // 11
                "Current Density", // 12
                "Length", // 13
                "Weight", // 14
                "The moment of force relative to the axis of rotation", // 15
                "Quantity of a substance", // 16
                "Amount of substance",
                "Normal force", // 17
                "Mechanical power",
                "Impulse", // 18
                "Pressure",
                "Weight",
                "Electric power", // 19
                "Electric charge", // 20
                "Heat", // 21
                "Radius", // 22
                "Resistance", // 23
                "Area", // 24
                "Displacement", // 25
                "Rotation period", // 26
                "Temperature (°C)", // 27
                "Temperature Converter",
                "Time", // 28
                "Voltage", // 29
                "Internal energy", // 30
                "Volume", // 31
                "Speed", // 32
                "Displacement", // 33
                "Friction coefficient", // 34
                "Density",
                "Angular velocity", // 35
                "Energy conversion efficiency", // 36
                "Magnetic flux"
        };

        formulaGroups = new String[]{
                "Mechanics",//1
                "Mechanics",//2
                "Electrodynamics",
                "Thermal phenomena",//3
                "Thermal phenomena",//4
                "Electrodynamics",
                "Light phenomena",//5
                "Mechanics",//6
                "Mechanics",//7
                "Light phenomena",//8
                "Mechanics",//9
                "Mechanics",//10
                "Electrodynamics",//11
                "Electrodynamics",//12
                "Mechanics",//13
                "Mechanics",//14
                "Statics",//15
                "Molecular physics",//16
                "Mechanics",
                "Mechanics",//17
                "Mechanics",
                "Mechanics",//18
                "Mechanics",
                "Mechanics",
                "Electrodynamics",//19
                "Electrodynamics",//20
                "Thermal phenomena",//21
                "Mechanics",//22
                "Electrodynamics",//23
                "Space",//24
                "Mechanics",//25
                "Mechanics",//26
                "Thermal phenomena",//27
                "Thermal phenomena",
                "Mechanics",//28
                "Electrodynamics",//29
                "Thermodynamics",//30
                "Space",//31
                "Mechanics",//32
                "Mechanics",//33
                "Mechanics",//34
                "Mechanics",
                "Mechanics",//35
                "Mechanics",//36
                "Electrodynamics"
        };

        formulaHintsFields = new String[][]{
                {"Applied force", "Displacement", "Angle of applied force", "Friction force", "Weight", "Initial height", "Final height", "Spring stiffness coefficient", "Initial coordinate", "Final coordinate ","Mechanical power ","Time ","Initial speed ","Final speed ","Useful work ","Full work ","Efficiency ","Gas pressure ","Initial volume ","Final volume " , "Energy communicated to the system", "Initial tell-tale energy", "Final internal energy", "Amperage", "Voltage", "Current resistance", "Power"},
                {"Final velocity", "Initial velocity", "Time", "Displacement", "Final coordinate", "Initial coordinate", "Linear velocity", "Radius of curvature", "Angular velocity", "Force applied to the body" , "Body mass"},
                {"Strength from the electric field to the conductor", "Current strength", "Conductor length", "Magnetic flux", "Closed loop area", "Angle of flow to the contour plane"},
                {"Amount of heat", "Weight", "Initial temperature", "Final temperature", "Heat capacity"},
                {"Specific Heat", "Mass"},
                {"Electric charge", "Voltage between the plates", "Relative dielectric constant of the medium", "Area of ​​the capacitor plate", "Distance between the plates", "Electric potential", "Ball radius"},
                {"Focal length"},
                {"Moment of power", "Applied force"},
                {"Mass", "Speed", "Lifting height", "Spring elastic coefficient", "Spring deformation", "Total energy", "Kinetic energy", "Potential energy", "Photon frequency"},
                {"Optical power of the lens"},
                {"Acceleration", "Mass", "Sliding friction coefficient", "Support normal reaction force", "Stiffness", "Moving", "Mass of the first body", "Mass of the second body", "Distance between bodies", "Final speed", "Initial speed", "Moment of force relative to the axis of rotation", "Diameter", "Liquid pressure", "Surface area", "Liquid density", "Vessel height", "Bottom surface area", "Area vessel’s lateral surface ","Liquid volume","Work ","Displacement "," Angle of applied force "," Power "," Time "},
                {"Work of gravity", "Density of the liquid", "Pressure force on the bottom of the vessel", "Surface area of ​​the bottom", "Pressure on the sides of the vessel", "Area of ​​lateral porosity", "Potential energy", "Weight", "Initial height", "Final height"},
                {"Time", "Cross-sectional area of ​​the conductor", "Number of charged particles", "Electric charge", "Particle velocity", "Current density", "Current voltage", "Current resistance", "Current operation", "Power current ","The allocated amount of heat ","Amplitude current ","Effective AC current "},
                {"Current", "Cross-sectional area of ​​the conductor"},
                {"Oscillation period of a mathematical pendulum", "Current resistance", "Conductor cross-sectional area", "Density of a substance"},
                {"Acceleration", "Force applied to the body", "Gravity", "Weight", "Mass of one of two bodies", "Gravity of two bodies", "Distance between two bodies", "Time", "Ultimate speed ","Initial speed ","Density of a substance ","Volume of a substance ","Work ","Initial height ","Final height ","Kinetic energy ","Speed ","Potential energy ","Lifting height body ","Oscillation period of the spring pendulum ","Spring stiffness ","Amount of substance ","Molar mass ","Ideal gas pressure ","Ideal gas volume ","Ideal g temperature aza ","Internal energy of an ideal gas ","Amount of heat ","Specific heat ","Initial temperature ","Final temperature ","Heat capacity ","Body mass at rest ","Energy "},
                {"Strength", "Diameter"},
                {"Mass of substance", "Molar mass of substance"},
                {"Number of rotations", "Time", "Circulation period", "Linear speed", "Radius", "Angular speed"},
                {"Friction force", "Friction coefficient"},
                {"Strength", "Speed", "Work", "Time"},
                {"Mass", "Speed"},
                {"Volume of gas", "Mass of ideal gas", "Molar mass of ideal gas", "Gas temperature", "Concentration of gas molecules", "Liquid density", "Liquid column height", "Strength", "Area", "Work done by gas ","Initial volume ","Final volume "},
                {"Mass", "Acceleration of Free Fall"},
                {"Work current", "Time", "Current", "Electric voltage", "Current resistance"},
                {"Potential energy of interaction of two charges", "One of two charges", "Distance between charges", "Electric current strength", "Time"},
                {"Specific heat", "Mass", "Initial temperature", "Final temperature", "Work on bodies", "Initial internal energy", "Final internal energy", "Amount of heat of the heater", "Amount of heat of the refrigerator", "Efficiency", "Amperage", "Current resistance", "Temperature", "Specific calorific value"},
                {"Linear speed", "Rotation period", "Rotation frequency", "Angular velocity", "Centripetal acceleration"},
                {"Current", "Voltage", "Density of the substance", "Length of the conductor", "Cross-sectional area of ​​the conductor", "Work of electric current", "Time", "Power of electric current", "Amount of heat"},
                {"Pressure on the bottom of the vessel", "Height of the vessel", "Density", "Pressure on the sides of the vessel", "Current density", "Current", "Current resistance", "Conductor length"},
                {"Speed", "Time", "Initial speed", "Acceleration", "Work", "Force", "Angle of applied force", "Friction force"},
                {"Time", "Number of accesses", "Frequency of accesses", "Speed", "Radius", "Angular velocity", "Mass", "Elasticity coefficient", "Pendulum length"},
                {"Pressure", "Volume of a substance", "Mass", "Molar mass of a substance", "Internal energy of an ideal gas", "Amount of heat", "Specific heat", "Initial temperature", "Final temperature", "Heater temperature ","Refrigerator temperature ","Efficiency "},
                {"Temperature in ° C", "Temperature in Kelvin"},
                {"Speed", "Displacement", "Final coordinate", "Initial coordinate", "Acceleration", "Initial speed", "Frequency of calls", "Number of calls", "Period of contact", "Weight", "Angular speed ","Point turning angle ","Force applied to the body ","Current strength ","Electric charge ","Current work ","Current voltage ","Current resistance ","Current power ","Heat amount ", "The number of nuclei at the desired time", "The number of nuclei at the initial moment of time", "Half-life"},
                {"Current strength", "Current resistance", "Electric current operation", "Time", "Electric current power", "Amplitude value of alternating voltage"},
                {"Ideal gas mass", "Molar mass of the ideal gas", "Ideal gas temperature"},
                {"Density of a substance", "Mass of a substance", "Strength of Archimedes", "Pressure", "Molar mass of a substance", "Temperature", "Gas operation", "Initial gas volume", "Final gas volume"},
                {"Displacement", "Time", "Final coordinate", "Initial coordinate", "Acceleration", "Final speed", "Initial speed", "Radius", "Rotation period", "Rotation frequency", "Angular velocity ","Force applied to the body ","Weight ","Power during movement ","Kinetic energy ","Work "},
                {"Linear speed", "Time", "Initial speed", "Acceleration", "Projection of elastic force", "Stiffness", "Work of elastic force", "Initial coordinate", "Final coordinate", "Potential energy" },
                {"The force of friction", "The strength of the normal reaction of the support"},
                {"Mass of substance", "Volume of substance", "Liquid pressure", "Height", "Area", "Strength", "Electrical resistance", "Conductor length"},
                {"The angle of rotation of the point around the center", "Time", "Rotation period", "Rotation frequency", "Linear speed", "Radius of the circle", "Centripetal acceleration"},
                {"Useful work", "Energy expended", "Heat from the heater", "Heat to the refrigerator", "Heater temperature", "Refrigerator temperature"},
                {"Magnetic induction", "Contour area", "The angle between the normal and the plane of magnetic induction"}
        };



        measure = new String[][]{
                {"N", "m", "°", "N", "kg", "m", "m", "N/m", "-", "-", "W", "s", "m/s", "m/s", "J", "J", "%", "Pa", "m³", "m³", "J", "J", "J", "A", "V", "Ω", "W"},
                {"m/s", "m/s", "s", "m", "-", "-", "m/s", "m", "rad/s", "N", "kg"},
                {"N", "A", "m", "Vb", "m²", "°"},
                {"J", "kg", "s", "s", "J/K"},
                {"J/kg·K", "kg"},
                {"C", "V", "-", "m²", "m", "V", "m"},
                {"m"},
                {"N·m", "N"},
                {"kg", "m/s", "m", "N/m", "-", "J", "J", "J", "Hz"},
                {"dpt"},
                {"m/s²", "kg", "-", "N", "N/m", "-", "kg", "kg", "m", "m/s", "m/s", "N·m", "m", "Pa", "m²", "kg/m³", "m", "m²", "m²", "m³", "J", "m", "°", "W", "s"},
                {"J", "kg/m³", "N", "m²", "N", "m²", "J", "kg", "m", "m"},
                {"s", "m²", "-", "C", "m/s", "A/m²", "V", "Ω", "J", "W", "J", "A", "A"},
                {"A", "m²"},
                {"Hz", "Ω", "m²", "kg/m³"},
                {"m/s²", "N", "N", "N", "kg", "N", "m", "s", "m/s", "m/s", "kg/m³", "m³", "J", "m", "m", "J", "m/s", "J", "m", "Hz", "N/m", "mol", "kg/mol", "Pa", "l", "K", "J", "J", "J/kg·K", "°C", "°C", "J/K", "kg", "J"},
                {"N", "m"},
                {"kg", "kg/mol"},
                {"-", "s", "Hz", "m/s", "m", "rad/s"},
                {"N", "-"},
                {"N", "m/s²", "J", "s"},
                {"kg", "m/s"},
                {"l", "kg", "g/mol", "K", "-", "kg/m³", "m", "N", "m²", "J", "m³", "m³"},
                {"kg", "m/s²"},
                {"J", "s", "A", "V", "Ω"},
                {"N", "C", "m", "N", "s"},
                {"J/kg·K", "kg", "°C", "°C", "J", "J", "J", "J", "J", "%", "A", "Ω", "°C", "J/kg"},
                {"m/s", "Hz", "Hz", "rad/s", "m/s²"},
                {"A", "V", "kg/m³", "m", "m²", "J", "s", "W", "J"},
                {"N", "m", "kg/m³", "N", "A/m²", "A", "Ω", "m"},
                {"m/s", "s", "m/s", "m/s²", "J", "N", "°", "N"},
                {"s", "-", "Hz", "m/s", "m", "rad/s", "kg", "kg/s²", "m"},
                {"Pa", "l", "kg", "kg/mol", "J", "J", "J/kg·K", "°C", "°C", "°C", "°C", "%"},
                {"°C", "K"},
                {"m/s", "m", "-", "-", "m/s²", "m/s", "Hz", "-", "Hz", "kg", "rad/s", "°", "N", "A", "C", "J", "V", "Ω", "W", "J", "-", "-", "s"},
                {"A", "Ω", "J", "s", "W", "V"},
                {"kg", "kg/mol", "K"},
                {"kg/m³", "kg", "N", "Pa", "kg/mol", "K", "J", "m³", "m³"},
                {"m", "s", "-", "-", "m/s²", "m/s", "m/s", "m", "Hz", "Hz", "rad/s", "N", "kg", "W", "J", "J"},
                {"m/s", "s", "m/s", "m/s²", "N", "N/m", "J", "-", "-", "J"},
                {"N", "N"},
                {"kg", "m³", "Pa", "m", "m²", "N", "Ω", "m"},
                {"°", "s", "Hz", "Hz", "m/s", "m", "m/s²"},
                {"J", "J", "J", "J", "°C", "°C"},
                {"T", "m²", "°"}
        };

        answerMeasure = new String[]{
                "J",
                "m/s²",
                "T",
                "J/(kg*K)",
                "J/K",
                "F",
                "dpt",
                "m",
                "J",
                "m",
                "N",
                "m",
                "A",
                "A/m²",
                "m",
                "kg",
                "N*m",
                "mol",
                "Hz",
                "N",
                "W",
                "kg*m/s",
                "Pa",
                "N",
                "W",
                "C",
                "J",
                "m",
                "Ω",
                "m²",
                "m",
                "Hz",
                "°C",
                "-",
                "s",
                "V",
                "J",
                "m",
                "m/s",
                "m³",
                "-",
                "kg/m³",
                "rad/s",
                "%",
                "Wb"
        };

        calcDescription = new String[][]{
                {"Power of electric current", "Work of electric current (without current)", "Work of electric current (without voltage)", "Work of electric current (without resistance)", "Efficiency of a heat engine", "Equation of the first law of thermodynamics" , "Work done by gas", "The kinetic energy theorem of the body", "Work of elastic force", "Work of gravity", "Work of friction force", "Work of constant force with an applied angle", "Work of constant force"},
                {"Acceleration according to Newton’s second law", "Centripetal acceleration through angular velocity", "Centripetal acceleration through linear velocity", "Equally accelerated motion equation", "Projection of displacement with uniformly accelerated motion without time", "Dependence of displacement with uniformly accelerated motion on time" , "Acceleration with uniformly accelerated motion"},
                {"Heat capacity of the body", "The amount of heat with a change in body temperature"},
                {"Body heat capacity"},
                {"Electric capacity of a ball", "Electric capacity of a capacitor through potential", "Electric capacity of a flat capacitor", "Electric capacity of a capacitor through voltage"},
                {"Optical power of the lens"},
                {"The moment of force relative to the axis of rotation"},
                {"Photon energy", "The relationship between mass and energy", "The total mechanical energy of a closed system of bodies", "Potential energy through the full", "Kinetic energy through the full", "Potential energy of an elastically deformed body", "Potential energy of the body" , "Kinetic energy of the body"},
                {"Optical power of the lens"},
                {"Work of friction force", "Work of constant force", "Force of Archimedes", "Force of fluid pressure on the lateral surface of the vessel", "Force of fluid pressure on the lateral surface of the vessel", "Moment of force relative to the axis of rotation", "Newton’s second law in pulsed form "," The force of universal gravitation "," The force of gravity "," The projection of the elastic force "," The module of the friction force "," Force according to Newton’s second law "},
                {"Potential energy of the body", "Work of the force of gravity", "Work of the force of gravity", "The force of the fluid pressure on the side surface of the vessel", "The force of the fluid pressure on the bottom of the vessel"},
                {"Effective AC current", "Amplitude AC power", "Dependence of current on the charge, concentration, speed and cross-sectional area of ​​the conductor", "Joule-Lenz law", "Power of electric current", "Power of electric current" , "Work of electric current", "Work of electric current", "Ohm law for a section of a circuit", "Module of density of electric current", "Electric current strength"},
                {"Module of electric current density"},
                {"Electrical resistance", "Period of oscillation of a mathematical pendulum"},
                {"The relationship between mass and energy", "The dependence of body mass on its speed", "Heat capacity of the body", "The amount of heat with a change in body temperature", "Internal energy of an ideal gas", "Mendeleev-Clapeyron equation", "The amount of substance" , "The period of oscillations of the spring pendulum", "The kinetic energy of the body theorem", "The potential energy of the body", "Kinetic energy of the body", "Work of gravity", "Density of matter", "Newton's second law in pulsed form", "Law gravity", "Gravity", "Newton’s Second Law"},
                {"The moment of force relative to the axis of rotation"},
                {"Amount of Substance"},
                {"Angular velocity expressed in terms of circulation frequency", "Linear velocity expressed in terms of circulation frequency", "Relationship between period and circulation frequency", "Frequency of circulation"},
                {"Modulus of friction force"},
                {"Power with uniform rectilinear motion", "Power with perfect work per unit of time"},
                {"Impulse"},
                {"Mendeleev-Clapeyron equation", "Dependence of gas pressure on the concentration of its molecules and temperature", "Dependence of liquid pressure on the height of its column", "Pressure", "Work done by gas"},
                {"Body weight in a stationary state", "Weight of a body thrown up", "Weight of a body falling down"},
                {"Power of current without current", "Power of current without voltage", "Power of current without resistance", "Power of current through its operation"},
                {"The strength of electric current", "Potential energy of interaction of two electric charges"},
                {"The Joule-Lenz law", "The efficiency of the heat engine through operation", "The amount of heat of the heater", "The amount of heat to the refrigerator", "The equation of the first law of thermodynamics", "The amount of body heat when its temperature changes", "The amount of heat during combustion fuel "},
                {"Centripetal acceleration through angular velocity", "Centripetal acceleration through linear velocity", "The relationship between linear and angular velocity", "Linear speed through the circulation frequency", "Linear speed through the circulation period"},
                {"Joule-Lenz law", "Power without current", "Power without current", "Work without current", "Work without current", "Dependence of resistance on the type of substance, length and cross section of the conductor", "Ohm's Law for the Chain Section"},
                {"Dependence of resistance on the type of substance, length and cross-section of the conductor", "Electric current density module", "Liquid pressure force on the side surface of the vessel", "Liquid pressure force on the bottom of the vessel"},
                {"Work of friction force", "Work of constant force", "Projection of displacement with uniformly accelerated motion without time", "Dependence of displacement with uniformly accelerated motion from time", "Displacement with uniformly accelerated motion", "Displacement with uniform rectilinear motion"},
                {"Oscillation period of the mathematical pendulum", "Oscillation period of the spring pendulum", "Angular velocity, expressed through the period of circulation", "Linear velocity, expressed through the period of circulation", "Relationship between the period and frequency of circulation", "Period of circulation"},
                {"Efficiency of an ideal heat engine (Heater temperature)", "Efficiency of an ideal heat engine (Refrigerator temperature)", "Amount of heat with a change in body temperature", "Amount of heat with a change in body temperature", "Internal energy of an ideal gas", "Mendeleev-Clapeyron equation"},
                {"Convert temperature from ° C to Kelvin", "Convert temperature from Kelvin to ° C"},
                {"Law of radioactive decay", "Joule-Lenz law", "Power of electric current", "Work of electric current without resistance", "Work of electric current without voltage", "Work of electric current without current", "Electric current" , "Newton’s second law in pulsed form", "Angular velocity", "Period of circulation", "Equation of uniformly accelerated motion", "Dependence of displacement with uniformly accelerated motion versus time", "Displacement with uniformly accelerated motion", "Speed ​​with uniformly accelerated motion", "Equation of uniform pr linear movement"},
                {"Effective value of alternating voltage", "Power of electric current without resistance", "Power of electric current without current", "Work of electric current without resistance", "Work of electric current without current", "Ohm's law for the circuit section"} ,
                {"The internal energy of an ideal gas"},
                {"Work done by gas", "Work done by gas", "Mendeleev-Clapeyron equation", "Law of Archimedes", "Density of substance"},
                {"The kinetic energy theory of the body (final velocity)", "The kinetic energy theory of the body (initial velocity)", "The kinetic energy of the body", "Newton's second law in pulsed form (finite velocity)", "Newton's second law in the pulsed form (initial velocity) "," Centripetal acceleration expressed in terms of linear velocity "," Formula of the relationship between linear and angular velocity "," Linear velocity expressed in terms of circulation frequency "," Linear velocity expressed in terms of circulation period "," Equally accelerated equation movement "," Pr motion projection with uniformly accelerated motion without time (final speed) "," Motion projection with uniformly accelerated motion without time (initial velocity) "," Relation of motion with uniformly accelerated motion from time "," Motion with uniformly accelerated motion (final speed) "," Motion with uniformly accelerated motion (initial speed) "," Speed ​​with uniformly accelerated motion (final speed) "," Speed ​​with uniformly accelerated motion (initial speed) "," Equation of uniform rectilinear motion "," Speed s uniform rectilinear motion "},
                {"Potential energy of an elastically deformed body", "Work of the elastic force (initial spring length)", "Work of the elastic force (final spring length)", "Projection of the elastic force", "Equation of uniformly accelerated motion (final coordinate)", "Equal-accelerated equation motion (initial coordinate) "," Equation of uniform rectilinear motion (final coordinate) "," Equation of uniform rectilinear motion (initial coordinate) "},
                {"Modulus of friction force"},
                {"Dependence of resistance on the type of substance, length and cross section of the conductor", "Law of Archimedes", "Pressure force of a liquid on the surface of a vessel", "Dependence of liquid pressure on the height of its column", "Density of a substance"},
                {"Centripetal acceleration expressed in terms of angular velocity", "Formula of the relationship between linear and angular velocity", "Angular velocity expressed in terms of circulation frequency", "Angular velocity expressed in terms of circulation", "Angular velocity"},
                {"Efficiency of an ideal heat engine", "Efficiency of a heat engine", "Efficiency of a heat engine"},
                {"Magnetic field induction", "Magnetic flux"},
                {"Magnetic flux"}
        };

    }

}




class Consts{
    static double g = 9.81;

    static double G = 6.67;
    static int Gpow = -11;

    static double R = 8.31;

    static double pi = 3.14;

    static double k = 1.380662;
    static int kpow = -23;

    static double h = 6.63;
    static int hpow = -34;

    static double c = 2.99792458;
    static int cpow = 8;

    static double T0 = 273.15;

    static double epsilon0 = 8.85;
    static int epsilon0pow = -12;

}

